app/views/attendance_mailer/confirmation_email.html.erb

  <body>
    <h1>Salut <%= @attendance.event.admin.first_name %> !</h1>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]