app/controllers/event_controller.rb

  def create

      start_date = params["start_date"]
      duration = params["duration"]
      title = params["title"]
      description = params["description"]
      price = params["price"]
      location = params["location"]

    event = Event.new
    event.start_date = start_date
    event.duration = duration
    event.title = title
    event.description = description
    event.price = price
    event.location = location
    event.admin = current_user



    if event.save
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @event = Event.find(params[:id])

    start_date = params["start_date"]
    duration = params["duration"]
    title = params["title"]
    description = params["description"]
    price = params["price"]
    location = params["location"]

    @event.update(
      start_date: start_date,
      duration: duration,
      title: title,
      description: description,
      price: price,
      location: location,
      admin: current_user
    )
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "events" SET "start_date" = $1, "duration" = $2, "title" = $3, "description" = $4, "price" = $5, "location" = $6, "admin_id" = $7, "updated_at" = $8 WHERE "events"."id" = $9