app/controllers/participations_controller.rb

  def index
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @event = Event.find(params[:event_id])
     # Amount in cents
    @amount =  @event.price

    customer = Stripe::Customer.create({
    email: params[:stripeEmail],
    source: params[:stripeToken],
    })

    charge = Stripe::Charge.create({
    customer: customer.id,
    amount: @amount,
    description: 'Rails Stripe customer',
    currency: 'usd',
    })


    participation = Attendance.new
    participation.event = @event
    participation.participant = current_user

    if participation.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "attendances" ("event_id", "participant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 1], ["participant_id", 1], ["created_at", "2019-08-21 09:23:20.184713"], ["updated_at", "2019-08-21 09:23:20.184713"]]